
'''''''''''''''运动信息'''''''''''''''''
# 机械臂参数
SPEEDRATE = 1

# 初始位置
INIT_POS = {1:1467, 2:1500, 3:1400, 4:1500, 5:1500}

# 准备位置
POS_READY = {1:2000, 2:2000, 3:1500,
command = '#1P2000#2P2000#3P1500T1000\r\n'

'''''''''''''''内置参数'''''''''''''''''
# 气泵
PUMP_SUCK = 0x01 # (吸气) 
PUMP_STOP = 0x00 # (停)   
PUMP_BLOW = 0x02 # (吹气) 


'''''''''''''''位置信息'''''''''''''''''

# 棋盘坐标 (y,x)
#         黑棋(机械臂)
#  (0,0) (0,1) (0,2) (0,3) ... (0,8)
#  (1,0) ...
#  (2,0)     ...
#  ...           ...
#  (9,0)              ...      (9,8)
#         红棋(人)

# 棋子摆放位置
#         黑棋(机械臂)
# 车 车                 将 卒
# 马 马                 卒 卒
# 炮 炮                 卒 卒
# 相 相                 士 士
# 仕 仕                 象 象
# 兵 兵                 砲 砲
# 兵 兵                 马 马
# 兵 帅                 车 车
#         红棋(人)
